Internet Engineering Task Force                               L. Chapin
Internet-Draft                                                Interisle
Intended Status: Informational                              M. McFadden
Expires: July 2014                          InterConnect Communications
                                                        January 7, 2014




                   Additional Reserved Top Level Domains
                 draft-chapin-additional-reserved-tlds-00


Abstract

   The Internet Domain Name System (DNS) defines a tree of names
   starting with root, ".", immediately below which are top level
   domain (TLD) names such as ".com" and ".us". In June 1999 RFC2606
   reserved a small number of TLD names for use in documentation
   examples, private testing, experiments, and other circumstances in
   which it is desirable to avoid conflict with current or future
   actual TLD names in the DNS.

   There has been significant evolution of Internet engineering and
   operation practices since RFC2606 was published. In February 2013
   RFC6761 defined criteria and procedures for reserving a domain name
   for special use, and established an IANA registry for such names.
   This document reserves eight domain name labels for special use in
   accordance with the criteria and procedures of RFC6761: localdomain,
   domain, lan, home, host, corp, mail, and exchange.

   It is important to note that TLD names may be reserved, in other
   contexts, for policy, political, or other reasons that are distinct
   from the IETF's concern with Internet engineering and operations.
   This document reserves TLD names only for operational and
   engineering reasons.

Status of this Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups. Note that
   other groups may also distribute working documents as Internet-
   Drafts.





Chapin                   Expires July 7, 2014                  [Page 1]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


   Internet-Drafts are draft documents valid for a maximum of six
   months and may be updated, replaced, or obsoleted by other documents
   at any time. It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html

   This Internet-Draft will expire on July 8, 2014.

Copyright Notice

   Copyright (c) 2014 IETF Trust and the persons identified as the
   document authors. All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document. Please review these documents
   carefully, as they describe your rights and restrictions with
   respect to this document.

Table of Contents

   1. Introduction...................................................4
   2. Conventions used in this document..............................5
   3. New top-level domain name reservations.........................5
   4. Security Considerations........................................6
   5. IANA Considerations............................................6
      5.1. Domain Name Reservation Considerations for "localdomain"..7
         5.1.1. Users:...............................................7
         5.1.2. Application Software:................................7
         5.1.3. Name Resolution APIs and Libraries:..................8
         5.1.4. Caching DNS Servers:.................................8
         5.1.5. Authoritative DNS Servers:...........................8
         5.1.6. DNS Server Operators:................................8
         5.1.7. DNS Registries/Registrars:...........................9
      5.2. Domain Name Reservation Considerations for "domain".......9
         5.2.1. Users:...............................................9
         5.2.2. Application Software:................................9
         5.2.3. Name Resolution APIs and Libraries:.................10
         5.2.4. Caching DNS Servers:................................10
         5.2.5. Authoritative DNS Servers:..........................10
         5.2.6. DNS Server Operators:...............................10


Chapin                   Expires July 7, 2014                  [Page 2]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


         5.2.7. DNS Registries/Registrars:..........................11
      5.3. Domain Name Reservation Considerations for "lan".........11
         5.3.1. Users:..............................................11
         5.3.2. Application Software:...............................12
         5.3.3. Name Resolution APIs and Libraries:.................12
         5.3.4. Caching DNS Servers:................................12
         5.3.5. Authoritative DNS Servers:..........................12
         5.3.6. DNS Server Operators:...............................13
         5.3.7. DNS Registries/Registrars:..........................13
      5.4. Domain Name Reservation Considerations for "home"........14
         5.4.1. Users:..............................................14
         5.4.2. Application Software:...............................14
         5.4.3. Name Resolution APIs and Libraries:.................14
         5.4.4. Caching DNS Servers:................................14
         5.4.5. Authoritative DNS Servers:..........................15
         5.4.6. DNS Server Operators:...............................15
         5.4.7. DNS Registries/Registrars:..........................15
      5.5. Domain Name Reservation Considerations for "host"........16
         5.5.1. Users:..............................................16
         5.5.2. Application Software:...............................16
         5.5.3. Name Resolution APIs and Libraries:.................16
         5.5.4. Caching DNS Servers:................................17
         5.5.5. Authoritative DNS Servers:..........................17
         5.5.6. DNS Server Operators:...............................17
         5.5.7. DNS Registries/Registrars:..........................18
      5.6. Domain Name Reservation Considerations for "corp"........18
         5.6.1. Users:..............................................18
         5.6.2. Application Software:...............................18
         5.6.3. Name Resolution APIs and Libraries:.................19
         5.6.4. Caching DNS Servers:................................19
         5.6.5. Authoritative DNS Servers:..........................19
         5.6.6. DNS Server Operators:...............................19
         5.6.7. DNS Registries/Registrars:..........................20
      5.7. Domain Name Reservation Considerations for "mail"........20
         5.7.1. Users:..............................................20
         5.7.2. Application Software:...............................20
         5.7.3. Name Resolution APIs and Libraries:.................21
         5.7.4. Caching DNS Servers:................................21
         5.7.5. Authoritative DNS Servers:..........................21
         5.7.6. DNS Server Operators:...............................21
         5.7.7. DNS Registries/Registrars:..........................22
      5.8. Domain Name Reservation Considerations for "exchange"....22
         5.8.1. Users:..............................................22
         5.8.2. Application Software:...............................23
         5.8.3. Name Resolution APIs and Libraries:.................23
         5.8.4. Caching DNS Servers:................................23
         5.8.5. Authoritative DNS Servers:..........................23


Chapin                   Expires July 7, 2014                  [Page 3]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


         5.8.6. DNS Server Operators:...............................24
         5.8.7. DNS Registries/Registrars:..........................24
   6. References....................................................25
      6.1. Normative References.....................................25
      6.2. Informative References...................................25
   7. Acknowledgments...............................................25


1. Introduction

   The Internet Domain Name System is documented in RFC1034 [2],
   RFC1035 [3], RFC1591 [4] and numerous additional Requests for
   Comment. It defines a tree of names starting with root, ".",
   immediately below which are top level domain names such as ".com"
   and ".us". Below top level domain names there are normally
   additional levels of names.

   RFC2606 [5] reserves a small number of TLD names which can be used
   for private testing of existing DNS related code, examples in
   documentation, DNS related experimentation, invalid DNS names, or
   other similar uses without fear of conflicts with current or future
   actual top-level domain names in the global DNS. RFC2606 also notes
   that the Internet Assigned Numbers Authority (IANA) reserves the
   label "example" at the second level below the TLDs .com, .net, and
   .org.

   Since RFC2606 was published in 1999, Internet engineering and
   operation practices have evolved in ways that led to the publication
   in February 2013 of RFC6761 [6], which defined criteria and
   procedures for reserving a domain name for special use and
   established an IANA registry to which additional reserved special
   use names might be added as new requirements arose.

   This document follows RFC6761 to add eight reserved top-level domain
   name labels to the IANA special-use names registry. It is prompted
   by the impending advent of new TLDs which might, in the absence of
   the reservations for which this document provides, introduce TLD
   labels that could create engineering and operational problems for
   root server operators and other DNS infrastructure providers.

   It is important to note that TLD names may be reserved, in other
   contexts, for policy, political, or other reasons that are distinct
   from the IETF's concern with Internet engineering and operations.
   This document reserves TLD names only for operational and
   engineering reasons.




Chapin                   Expires July 7, 2014                  [Page 4]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


2. Conventions used in this document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC2119 [1].

   In this document, these words will appear with that interpretation
   only when in ALL CAPS. Lower case uses of these words are not to be
   interpreted as carrying RFC2119 significance.

3. New top-level domain name reservations

   In its report (SAC 045) of a quantitative study of queries to the
   DNS root servers entitled "Invalid Top Level Domain Queries at the
   Root Level of the Domain Name System" [8] ICANN's Security and
   Stability Advisory Committee "calls attention to the potential
   problems that may arise should a new TLD applicant use a string that
   has been seen with measurable (and meaningful) frequency in a query
   for resolution by the root system and the root system has previously
   generated a response."

   Of particular concern is the case in which a string "has been
   queried and a root name server has responded to the query with a
   non-existent domain (NXDOMAIN) result, i.e., the string has not been
   delegated but has been queried."  SAC 045 reports the results of a
   CAIDA measurement study [9] which found that "NXDOMAIN responses
   account for more than 25 percent of the total responses from root
   name servers observed in the study, and the top ten such strings
   account for 10 percent of the total query load."

   SAC 045 describes in detail the engineering and operational problems
   that would ensue from the delegation, as new valid TLD names, of
   previously invalid labels that have frequently appeared in queries
   to the root: "If the [new TLD label] were to be approved and the TLD
   included in the root zone, queries to the root level of the DNS for
   a string that hitherto returned NXDOMAIN would begin to return
   positive responses containing name servers of the new TLD."

   Recommendation (2) of SAC 045 calls for the community to develop
   principles for "prohibiting the delegation of additional strings to
   those already identified in RFC2606 [5]." As the first step in that
   process, based on the data reported by SAC 045, this document adds
   to the list of names that may not be used for top-level domains the
   following labels:

     . localdomain
     . domain


Chapin                   Expires July 7, 2014                  [Page 5]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


     . lan
     . home
     . host
     . corp

   These six top-level domain labels are to be added to the "Special-
   Use Domain Names" registry created by RFC6761, as described in the
   IANA Considerations section of this document.

   In addition, SAC 062 describes the risks associated with delegating
   a name in the root of the public DNS that is also used in privately
   defined namespaces (in which it is also syntactically valid). Users,
   software, or other functions in the private domain may confuse the
   private and public instances of the same name. This risk, referred
   to as "name collision," results in potential harm to enterprise
   networks that use previously undelegated names at the root of a
   private namespace when the name is delegated in the public root.

   Research conducted by Interisle Consulting Group [10] indicates that
   two names in addition to those identified by SAC 045 present a
   particularly high risk of name collision. This document therefore
   also adds the following strings to the "Special-Use Domain Names"
   registry:

     . mail
     . exchange

4. Security Considerations

   The name reservations specified in this document are intended to
   reduce the risk of harmful collision between names that are in well-
   established common use as TLDs in private namespaces and
   syntactically identical names that could otherwise be delegated as
   TLDs in the global DNS.

   The security concerns associated with name collision are well
   presented in SAC 045, SAC 062, the Interisle report, and the ICANN
   report "Name Collision Identification and Mitigation for IT
   Professionals" [11].

5. IANA Considerations

   This document specifies eight new labels to be added to the
   "Special-Use Domain Names" registry maintained by IANA pursuant to
   RFC6761. The labels are to be added to the registry in the following
   way:



Chapin                   Expires July 7, 2014                  [Page 6]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


   Name             Reference

   ----------------+---------------

   localdomain      [ RFC-to-be ]

   domain           [ RFC-to-be ]

   lan              [ RFC-to-be ]

   home             [ RFC-to-be ]

   host             [ RFC-to-be ]

   corp             [ RFC-to-be ]

   mail             [ RFC-to-be ]

   exchange         [ RFC-to-be ]

5.1. Domain Name Reservation Considerations for "localdomain"

5.1.1. Users:

   Are human users expected to recognize these names as special and use
   them differently? In what way?

   The reservations provided in this document are intended to reduce
   spurious queries at the root of the DNS and avoid potential
   collisions between resolutions of names in private name spaces and
   the public DNS. Users do not have to know that these names are
   special.

5.1.2. Application Software:

   Are writers of application software expected to make their software
   recognize these names as special and treat them differently? In what
   way? (For example, if a human user enters such a name, should the
   application software reject it with an error message?)

   These names are being added to the Special-Use Domain Name registry,
   in part, because some application software implementations have long
   used these names for special purposes in private networks.
   Developers of new applications do not need to filter or test for the
   names. Instead, the intent is to reserve the names for local use and
   avoid unnecessary queries in the public DNS.



Chapin                   Expires July 7, 2014                  [Page 7]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


5.1.3. Name Resolution APIs and Libraries:

   Are writers of name resolution APIs and libraries expected to make
   their software recognize these names as special and treat them
   differently? If so, how?

   Authors of name resolution APIs and libraries SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.1.4. Caching DNS Servers:

   Are developers of caching domain name servers expected to make their
   implementations recognize these names as special and treat them
   differently? If so, how?

   Authors of caching domain name server software SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.1.5. Authoritative DNS Servers:

   Are developers of authoritative domain name servers expected to make
   their implementations recognize these names as special and treat
   them differently? If so, how?

   Authors of authoritative domain name server software SHOULD restrict
   these names to local resolution and SHOULD NOT allow queries for
   strings that use these Special-Use Domain Names to be forwarded to
   the public DNS for resolution.

5.1.6. DNS Server Operators:

   Does this reserved Special-Use Domain Name have any potential impact
   on DNS server operators? If they try to configure their
   authoritative DNS server as authoritative for this reserved name,
   will compliant name server software reject it as invalid? Do DNS
   server operators need to know about that and understand why? Even if
   the name server software doesn't prevent them from using this
   reserved name, are there other ways that it may not work as
   expected, of which the DNS server operator should be aware?

   The intent of the reservations in this IANA Considerations section
   is to prevent spurious and potentially problematic queries from
   appearing in the public DNS. DNS server operators SHOULD always


Chapin                   Expires July 7, 2014                  [Page 8]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


   treat strings with the Special-Use Domain Names in section 5 as
   names for local resolution.

   Since these strings are intended to have local use, it is quite
   possible that DNS operators would configure an authoritative DNS
   server as authoritative for these reserved names in a private
   network. This would be consistent with the goal of having these
   names resolved locally rather than on the public Internet.
   Compliant name server software MUST NOT reject these names as
   invalid. Instead, name server software SHOULD allow for local
   resolution of the name and SHOULD not transmit a query for
   resolution into the public DNS.

5.1.7. DNS Registries/Registrars:

   How should DNS Registries/Registrars treat requests to register this
   reserved domain name?  Should such requests be denied? Should such
   requests be allowed, but only to a specially-designated entity? (For
   example, the name "www.example.org" is reserved for documentation
   examples and is not available for registration; however, the name is
   in fact registered; and there is even a web site at that name, which
   states circularly that the name is reserved for use in documentation
   and cannot be registered!)

   Requests to register any names added to the Special-Use Domain Name
   registry as part of the IANA Considerations section of this document
   MUST be denied.

5.2. Domain Name Reservation Considerations for "domain"

5.2.1. Users:

   Are human users expected to recognize these names as special and use
   them differently? In what way?

   The reservations provided in this document are intended to reduce
   spurious queries at the root of the DNS and avoid potential
   collisions between resolutions of names in private name spaces and
   the public DNS. Users do not have to know that these names are
   special.

5.2.2. Application Software:

   Are writers of application software expected to make their software
   recognize these names as special and treat them differently? In what
   way? (For example, if a human user enters such a name, should the
   application software reject it with an error message?)


Chapin                   Expires July 7, 2014                  [Page 9]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


   These names are being added to the Special-Use Domain Name registry,
   in part, because some application software implementations have long
   used these names for special purposes in private networks.
   Developers of new applications do not need to filter or test for the
   names. Instead, the intent is to reserve the names for local use and
   avoid unnecessary queries in the public DNS.

5.2.3. Name Resolution APIs and Libraries:

   Are writers of name resolution APIs and libraries expected to make
   their software recognize these names as special and treat them
   differently? If so, how?

   Authors of name resolution APIs and libraries SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.2.4. Caching DNS Servers:

   Are developers of caching domain name servers expected to make their
   implementations recognize these names as special and treat them
   differently? If so, how?

   Authors of caching domain name server software SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.2.5. Authoritative DNS Servers:

   Are developers of authoritative domain name servers expected to make
   their implementations recognize these names as special and treat
   them differently? If so, how?

   Authors of authoritative domain name server software SHOULD restrict
   these names to local resolution and SHOULD NOT allow queries for
   strings that use these Special-Use Domain Names to be forwarded to
   the public DNS for resolution.

5.2.6. DNS Server Operators:

   Does this reserved Special-Use Domain Name have any potential impact
   on DNS server operators? If they try to configure their
   authoritative DNS server as authoritative for this reserved name,
   will compliant name server software reject it as invalid? Do DNS
   server operators need to know about that and understand why? Even if


Chapin                   Expires July 7, 2014                 [Page 10]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


   the name server software doesn't prevent them from using this
   reserved name, are there other ways that it may not work as
   expected, of which the DNS server operator should be aware?

   The intent of the reservations in this IANA Considerations section
   is to prevent spurious and potentially problematic queries from
   appearing in the public DNS. DNS server operators SHOULD always
   treat strings with the Special-Use Domain Names in section 5 as
   names for local resolution.

   Since these strings are intended to have local use, it is quite
   possible that DNS operators would configure an authoritative DNS
   server as authoritative for these reserved names in a private
   network. This would be consistent with the goal of having these
   names resolved locally rather than on the public Internet.
   Compliant name server software MUST NOT reject these names as
   invalid. Instead, name server software SHOULD allow for local
   resolution of the name and SHOULD not transmit a query for
   resolution into the public DNS.

5.2.7. DNS Registries/Registrars:

   How should DNS Registries/Registrars treat requests to register this
   reserved domain name?  Should such requests be denied? Should such
   requests be allowed, but only to a specially-designated entity? (For
   example, the name "www.example.org" is reserved for documentation
   examples and is not available for registration; however, the name is
   in fact registered; and there is even a web site at that name, which
   states circularly that the name is reserved for use in documentation
   and cannot be registered!)

   Requests to register any names added to the Special-Use Domain Name
   registry as part of the IANA Considerations section of this document
   MUST be denied.

5.3. Domain Name Reservation Considerations for "lan"

5.3.1. Users:

   Are human users expected to recognize these names as special and use
   them differently? In what way?

   The reservations provided in this document are intended to reduce
   spurious queries at the root of the DNS and avoid potential
   collisions between resolutions of names in private name spaces and
   the public DNS. Users do not have to know that these names are
   special.


Chapin                   Expires July 7, 2014                 [Page 11]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


5.3.2. Application Software:

   Are writers of application software expected to make their software
   recognize these names as special and treat them differently? In what
   way? (For example, if a human user enters such a name, should the
   application software reject it with an error message?)

   These names are being added to the Special-Use Domain Name registry,
   in part, because some application software implementations have long
   used these names for special purposes in private networks.
   Developers of new applications do not need to filter or test for the
   names. Instead, the intent is to reserve the names for local use and
   avoid unnecessary queries in the public DNS.

5.3.3. Name Resolution APIs and Libraries:

   Are writers of name resolution APIs and libraries expected to make
   their software recognize these names as special and treat them
   differently? If so, how?

   Authors of name resolution APIs and libraries SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.3.4. Caching DNS Servers:

   Are developers of caching domain name servers expected to make their
   implementations recognize these names as special and treat them
   differently? If so, how?

   Authors of caching domain name server software SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.3.5. Authoritative DNS Servers:

   Are developers of authoritative domain name servers expected to make
   their implementations recognize these names as special and treat
   them differently? If so, how?

   Authors of authoritative domain name server software SHOULD restrict
   these names to local resolution and SHOULD NOT allow queries for
   strings that use these Special-Use Domain Names to be forwarded to
   the public DNS for resolution.



Chapin                   Expires July 7, 2014                 [Page 12]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


5.3.6. DNS Server Operators:

   Does this reserved Special-Use Domain Name have any potential impact
   on DNS server operators? If they try to configure their
   authoritative DNS server as authoritative for this reserved name,
   will compliant name server software reject it as invalid? Do DNS
   server operators need to know about that and understand why? Even if
   the name server software doesn't prevent them from using this
   reserved name, are there other ways that it may not work as
   expected, of which the DNS server operator should be aware?

   The intent of the reservations in this IANA Considerations section
   is to prevent spurious and potentially problematic queries from
   appearing in the public DNS. DNS server operators SHOULD always
   treat strings with the Special-Use Domain Names in section 5 as
   names for local resolution.

   Since these strings are intended to have local use, it is quite
   possible that DNS operators would configure an authoritative DNS
   server as authoritative for these reserved names in a private
   network. This would be consistent with the goal of having these
   names resolved locally rather than on the public Internet.
   Compliant name server software MUST NOT reject these names as
   invalid. Instead, name server software SHOULD allow for local
   resolution of the name and SHOULD not transmit a query for
   resolution into the public DNS.

5.3.7. DNS Registries/Registrars:

   How should DNS Registries/Registrars treat requests to register this
   reserved domain name?  Should such requests be denied? Should such
   requests be allowed, but only to a specially-designated entity? (For
   example, the name "www.example.org" is reserved for documentation
   examples and is not available for registration; however, the name is
   in fact registered; and there is even a web site at that name, which
   states circularly that the name is reserved for use in documentation
   and cannot be registered!)

   Requests to register any names added to the Special-Use Domain Name
   registry as part of the IANA Considerations section of this document
   MUST be denied.








Chapin                   Expires July 7, 2014                 [Page 13]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


5.4. Domain Name Reservation Considerations for "home"

5.4.1. Users:

   Are human users expected to recognize these names as special and use
   them differently? In what way?

   The reservations provided in this document are intended to reduce
   spurious queries at the root of the DNS and avoid potential
   collisions between resolutions of names in private name spaces and
   the public DNS. Users do not have to know that these names are
   special.

5.4.2. Application Software:

   Are writers of application software expected to make their software
   recognize these names as special and treat them differently? In what
   way? (For example, if a human user enters such a name, should the
   application software reject it with an error message?)

   These names are being added to the Special-Use Domain Name registry,
   in part, because some application software implementations have long
   used these names for special purposes in private networks.
   Developers of new applications do not need to filter or test for the
   names. Instead, the intent is to reserve the names for local use and
   avoid unnecessary queries in the public DNS.

5.4.3. Name Resolution APIs and Libraries:

   Are writers of name resolution APIs and libraries expected to make
   their software recognize these names as special and treat them
   differently? If so, how?

   Authors of name resolution APIs and libraries SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.4.4. Caching DNS Servers:

   Are developers of caching domain name servers expected to make their
   implementations recognize these names as special and treat them
   differently? If so, how?

   Authors of caching domain name server software SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings



Chapin                   Expires July 7, 2014                 [Page 14]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.4.5. Authoritative DNS Servers:

   Are developers of authoritative domain name servers expected to make
   their implementations recognize these names as special and treat
   them differently? If so, how?

   Authors of authoritative domain name server software SHOULD restrict
   these names to local resolution and SHOULD NOT allow queries for
   strings that use these Special-Use Domain Names to be forwarded to
   the public DNS for resolution.

5.4.6. DNS Server Operators:

   Does this reserved Special-Use Domain Name have any potential impact
   on DNS server operators? If they try to configure their
   authoritative DNS server as authoritative for this reserved name,
   will compliant name server software reject it as invalid? Do DNS
   server operators need to know about that and understand why? Even if
   the name server software doesn't prevent them from using this
   reserved name, are there other ways that it may not work as
   expected, of which the DNS server operator should be aware?

   The intent of the reservations in this IANA Considerations section
   is to prevent spurious and potentially problematic queries from
   appearing in the public DNS. DNS server operators SHOULD always
   treat strings with the Special-Use Domain Names in section 5 as
   names for local resolution.

   Since these strings are intended to have local use, it is quite
   possible that DNS operators would configure an authoritative DNS
   server as authoritative for these reserved names in a private
   network. This would be consistent with the goal of having these
   names resolved locally rather than on the public Internet.
   Compliant name server software MUST NOT reject these names as
   invalid. Instead, name server software SHOULD allow for local
   resolution of the name and SHOULD not transmit a query for
   resolution into the public DNS.

5.4.7. DNS Registries/Registrars:

   How should DNS Registries/Registrars treat requests to register this
   reserved domain name? Should such requests be denied? Should such
   requests be allowed, but only to a specially-designated entity? (For
   example, the name "www.example.org" is reserved for documentation


Chapin                   Expires July 7, 2014                 [Page 15]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


   examples and is not available for registration; however, the name is
   in fact registered; and there is even a web site at that name, which
   states circularly that the name is reserved for use in documentation
   and cannot be registered!)

   Requests to register any names added to the Special-Use Domain Name
   registry as part of the IANA Considerations section of this document
   MUST be denied.

5.5. Domain Name Reservation Considerations for "host"

5.5.1. Users:

   Are human users expected to recognize these names as special and use
   them differently? In what way?

   The reservations provided in this document are intended to reduce
   spurious queries at the root of the DNS and avoid potential
   collisions between resolutions of names in private name spaces and
   the public DNS. Users do not have to know that these names are
   special.

5.5.2. Application Software:

   Are writers of application software expected to make their software
   recognize these names as special and treat them differently? In what
   way? (For example, if a human user enters such a name, should the
   application software reject it with an error message?)

   These names are being added to the Special-Use Domain Name registry,
   in part, because some application software implementations have long
   used these names for special purposes in private networks.
   Developers of new applications do not need to filter or test for the
   names. Instead, the intent is to reserve the names for local use and
   avoid unnecessary queries in the public DNS.

5.5.3. Name Resolution APIs and Libraries:

   Are writers of name resolution APIs and libraries expected to make
   their software recognize these names as special and treat them
   differently? If so, how?

   Authors of name resolution APIs and libraries SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.



Chapin                   Expires July 7, 2014                 [Page 16]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


5.5.4. Caching DNS Servers:

   Are developers of caching domain name servers expected to make their
   implementations recognize these names as special and treat them
   differently? If so, how?

   Authors of caching domain name server software SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.5.5. Authoritative DNS Servers:

   Are developers of authoritative domain name servers expected to make
   their implementations recognize these names as special and treat
   them differently? If so, how?

   Authors of authoritative domain name server software SHOULD restrict
   these names to local resolution and SHOULD NOT allow queries for
   strings that use these Special-Use Domain Names to be forwarded to
   the public DNS for resolution.

5.5.6. DNS Server Operators:

   Does this reserved Special-Use Domain Name have any potential impact
   on DNS server operators? If they try to configure their
   authoritative DNS server as authoritative for this reserved name,
   will compliant name server software reject it as invalid? Do DNS
   server operators need to know about that and understand why? Even if
   the name server software doesn't prevent them from using this
   reserved name, are there other ways that it may not work as
   expected, of which the DNS server operator should be aware?

   The intent of the reservations in this IANA Considerations section
   is to prevent spurious and potentially problematic queries from
   appearing in the public DNS. DNS server operators SHOULD always
   treat strings with the Special-Use Domain Names in section 5 as
   names for local resolution.

   Since these strings are intended to have local use, it is quite
   possible that DNS operators would configure an authoritative DNS
   server as authoritative for these reserved names in a private
   network. This would be consistent with the goal of having these
   names resolved locally rather than on the public Internet.
   Compliant name server software MUST NOT reject these names as
   invalid. Instead, name server software SHOULD allow for local



Chapin                   Expires July 7, 2014                 [Page 17]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


   resolution of the name and SHOULD not transmit a query for
   resolution into the public DNS.

5.5.7. DNS Registries/Registrars:

   How should DNS Registries/Registrars treat requests to register this
   reserved domain name?  Should such requests be denied? Should such
   requests be allowed, but only to a specially-designated entity? (For
   example, the name "www.example.org" is reserved for documentation
   examples and is not available for registration; however, the name is
   in fact registered; and there is even a web site at that name, which
   states circularly that the name is reserved for use in documentation
   and cannot be registered!)

   Requests to register any names added to the Special-Use Domain Name
   registry as part of the IANA Considerations section of this document
   MUST be denied.

5.6. Domain Name Reservation Considerations for "corp"

5.6.1. Users:

   Are human users expected to recognize these names as special and use
   them differently? In what way?

   The reservations provided in this document are intended to reduce
   spurious queries at the root of the DNS and avoid potential
   collisions between resolutions of names in private name spaces and
   the public DNS. Users do not have to know that these names are
   special.

5.6.2. Application Software:

   Are writers of application software expected to make their software
   recognize these names as special and treat them differently? In what
   way? (For example, if a human user enters such a name, should the
   application software reject it with an error message?)

   These names are being added to the Special-Use Domain Name registry,
   in part, because some application software implementations have long
   used these names for special purposes in private networks.
   Developers of new applications do not need to filter or test for the
   names. Instead, the intent is to reserve the names for local use and
   avoid unnecessary queries in the public DNS.





Chapin                   Expires July 7, 2014                 [Page 18]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


5.6.3. Name Resolution APIs and Libraries:

   Are writers of name resolution APIs and libraries expected to make
   their software recognize these names as special and treat them
   differently? If so, how?

   Authors of name resolution APIs and libraries SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.6.4. Caching DNS Servers:

   Are developers of caching domain name servers expected to make their
   implementations recognize these names as special and treat them
   differently? If so, how?

   Authors of caching domain name server software SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.6.5. Authoritative DNS Servers:

   Are developers of authoritative domain name servers expected to make
   their implementations recognize these names as special and treat
   them differently? If so, how?

   Authors of authoritative domain name server software SHOULD restrict
   these names to local resolution and SHOULD NOT allow queries for
   strings that use these Special-Use Domain Names to be forwarded to
   the public DNS for resolution.

5.6.6. DNS Server Operators:

   Does this reserved Special-Use Domain Name have any potential impact
   on DNS server operators? If they try to configure their
   authoritative DNS server as authoritative for this reserved name,
   will compliant name server software reject it as invalid? Do DNS
   server operators need to know about that and understand why? Even if
   the name server software doesn't prevent them from using this
   reserved name, are there other ways that it may not work as
   expected, of which the DNS server operator should be aware?

   The intent of the reservations in this IANA Considerations section
   is to prevent spurious and potentially problematic queries from
   appearing in the public DNS. DNS server operators SHOULD always


Chapin                   Expires July 7, 2014                 [Page 19]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


   treat strings with the Special-Use Domain Names in section 5 as
   names for local resolution.

   Since these strings are intended to have local use, it is quite
   possible that DNS operators would configure an authoritative DNS
   server as authoritative for these reserved names in a private
   network. This would be consistent with the goal of having these
   names resolved locally rather than on the public Internet.
   Compliant name server software MUST NOT reject these names as
   invalid. Instead, name server software SHOULD allow for local
   resolution of the name and SHOULD not transmit a query for
   resolution into the public DNS.

5.6.7. DNS Registries/Registrars:

   How should DNS Registries/Registrars treat requests to register this
   reserved domain name?  Should such requests be denied? Should such
   requests be allowed, but only to a specially-designated entity? (For
   example, the name "www.example.org" is reserved for documentation
   examples and is not available for registration; however, the name is
   in fact registered; and there is even a web site at that name, which
   states circularly that the name is reserved for use in documentation
   and cannot be registered!)

   Requests to register any names added to the Special-Use Domain Name
   registry as part of the IANA Considerations section of this document
   MUST be denied.

5.7. Domain Name Reservation Considerations for "mail"

5.7.1. Users:

   Are human users expected to recognize these names as special and use
   them differently? In what way?

   The reservations provided in this document are intended to reduce
   spurious queries at the root of the DNS and avoid potential
   collisions between resolutions of names in private name spaces and
   the public DNS. Users do not have to know that these names are
   special.

5.7.2. Application Software:

   Are writers of application software expected to make their software
   recognize these names as special and treat them differently? In what
   way? (For example, if a human user enters such a name, should the
   application software reject it with an error message?)


Chapin                   Expires July 7, 2014                 [Page 20]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


   These names are being added to the Special-Use Domain Name registry,
   in part, because some application software implementations have long
   used these names for special purposes in private networks.
   Developers of new applications do not need to filter or test for the
   names. Instead, the intent is to reserve the names for local use and
   avoid unnecessary queries in the public DNS.

5.7.3. Name Resolution APIs and Libraries:

   Are writers of name resolution APIs and libraries expected to make
   their software recognize these names as special and treat them
   differently? If so, how?

   Authors of name resolution APIs and libraries SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.7.4. Caching DNS Servers:

   Are developers of caching domain name servers expected to make their
   implementations recognize these names as special and treat them
   differently? If so, how?

   Authors of caching domain name server software SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.7.5. Authoritative DNS Servers:

   Are developers of authoritative domain name servers expected to make
   their implementations recognize these names as special and treat
   them differently? If so, how?

   Authors of authoritative domain name server software SHOULD restrict
   these names to local resolution and SHOULD NOT allow queries for
   strings that use these Special-Use Domain Names to be forwarded to
   the public DNS for resolution.

5.7.6. DNS Server Operators:

   Does this reserved Special-Use Domain Name have any potential impact
   on DNS server operators? If they try to configure their
   authoritative DNS server as authoritative for this reserved name,
   will compliant name server software reject it as invalid? Do DNS
   server operators need to know about that and understand why? Even if


Chapin                   Expires July 7, 2014                 [Page 21]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


   the name server software doesn't prevent them from using this
   reserved name, are there other ways that it may not work as
   expected, of which the DNS server operator should be aware?

   The intent of the reservations in this IANA Considerations section
   is to prevent spurious and potentially problematic queries from
   appearing in the public DNS. DNS server operators SHOULD always
   treat strings with the Special-Use Domain Names in section 5 as
   names for local resolution.

   Since these strings are intended to have local use, it is quite
   possible that DNS operators would configure an authoritative DNS
   server as authoritative for these reserved names in a private
   network. This would be consistent with the goal of having these
   names resolved locally rather than on the public Internet.
   Compliant name server software MUST NOT reject these names as
   invalid. Instead, name server software SHOULD allow for local
   resolution of the name and SHOULD not transmit a query for
   resolution into the public DNS.

5.7.7. DNS Registries/Registrars:

   How should DNS Registries/Registrars treat requests to register this
   reserved domain name? Should such requests be denied? Should such
   requests be allowed, but only to a specially-designated entity? (For
   example, the name "www.example.org" is reserved for documentation
   examples and is not available for registration; however, the name is
   in fact registered; and there is even a web site at that name, which
   states circularly that the name is reserved for use in documentation
   and cannot be registered!)

   Requests to register any names added to the Special-Use Domain Name
   registry as part of the IANA Considerations section of this document
   MUST be denied.

5.8. Domain Name Reservation Considerations for "exchange"

5.8.1. Users:

   Are human users expected to recognize these names as special and use
   them differently? In what way?

   The reservations provided in this document are intended to reduce
   spurious queries at the root of the DNS and avoid potential
   collisions between resolutions of names in private name spaces and
   the public DNS. Users do not have to know that these names are
   special.


Chapin                   Expires July 7, 2014                 [Page 22]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


5.8.2. Application Software:

   Are writers of application software expected to make their software
   recognize these names as special and treat them differently? In what
   way? (For example, if a human user enters such a name, should the
   application software reject it with an error message?)

   These names are being added to the Special-Use Domain Name registry,
   in part, because some application software implementations have long
   used these names for special purposes in private networks.
   Developers of new applications do not need to filter or test for the
   names. Instead, the intent is to reserve the names for local use and
   avoid unnecessary queries in the public DNS.

5.8.3. Name Resolution APIs and Libraries:

   Are writers of name resolution APIs and libraries expected to make
   their software recognize these names as special and treat them
   differently? If so, how?

   Authors of name resolution APIs and libraries SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.8.4. Caching DNS Servers:

   Are developers of caching domain name servers expected to make their
   implementations recognize these names as special and treat them
   differently? If so, how?

   Authors of caching domain name server software SHOULD restrict these
   names to local resolution and SHOULD NOT allow queries for strings
   that use these Special-Use Domain Names to be forwarded to the
   public DNS for resolution.

5.8.5. Authoritative DNS Servers:

   Are developers of authoritative domain name servers expected to make
   their implementations recognize these names as special and treat
   them differently? If so, how?

   Authors of authoritative domain name server software SHOULD restrict
   these names to local resolution and SHOULD NOT allow queries for
   strings that use these Special-Use Domain Names to be forwarded to
   the public DNS for resolution.



Chapin                   Expires July 7, 2014                 [Page 23]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


5.8.6. DNS Server Operators:

   Does this reserved Special-Use Domain Name have any potential impact
   on DNS server operators? If they try to configure their
   authoritative DNS server as authoritative for this reserved name,
   will compliant name server software reject it as invalid? Do DNS
   server operators need to know about that and understand why? Even if
   the name server software doesn't prevent them from using this
   reserved name, are there other ways that it may not work as
   expected, of which the DNS server operator should be aware?

   The intent of the reservations in this IANA Considerations section
   is to prevent spurious and potentially problematic queries from
   appearing in the public DNS. DNS server operators SHOULD always
   treat strings with the Special-Use Domain Names in section 5 as
   names for local resolution.

   Since these strings are intended to have local use, it is quite
   possible that DNS operators would configure an authoritative DNS
   server as authoritative for these reserved names in a private
   network. This would be consistent with the goal of having these
   names resolved locally rather than on the public Internet.
   Compliant name server software MUST NOT reject these names as
   invalid. Instead, name server software SHOULD allow for local
   resolution of the name and SHOULD not transmit a query for
   resolution into the public DNS.

5.8.7. DNS Registries/Registrars:

   How should DNS Registries/Registrars treat requests to register this
   reserved domain name? Should such requests be denied? Should such
   requests be allowed, but only to a specially-designated entity? (For
   example, the name "www.example.org" is reserved for documentation
   examples and is not available for registration; however, the name is
   in fact registered; and there is even a web site at that name, which
   states circularly that the name is reserved for use in documentation
   and cannot be registered!)

   Requests to register any names added to the Special-Use Domain Name
   registry as part of the IANA Considerations section of this document
   MUST be denied.








Chapin                   Expires July 7, 2014                 [Page 24]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


6. References

6.1. Normative References

   [1]   Bradner, S., "Key words for use in RFCs to Indicate
         Requirement Levels", BCP 14, RFC 2119, March 1997.

   [2]   Mockapetris, P., "Domain names - concepts and facilities", STD
         13, RFC 1034, November 1987.

   [3]   Mockapetris, P., "Domain names - implementation and
         specification", STD 13, RFC 1035, November 1987.

   [4]   Postel, J., "Domain Name System Structure and Delegation", RFC
         1591, March 1994.

   [5]   Eastlake, D. and A. Panitz, "Reserved Top Level DNS Names",
         BCP 32, RFC 2606, June 1999.

   [6]   Cheshire, S. and M. Krochmal, "Special-Use Domain Names", RFC
         6761, February 2013.

   [7]   <http://www.icann.org/en/committees/security/sac045.pdf>

   [8]   <http://www.icann.org/en/groups/ssac/documents/sac-062-en.pdf>

   [9]   <http://www.caida.org/publications/presentations/2009/rssac_dn
         s/rssac_dns.pdf>

   [10]  <http://www.icann.org/en/about/staff/security/ssr/name-
         collision-02aug13-en.pdf>

   [11]  <http://www.icann.org/en/about/staff/security/ssr/name-
         collision-mitigation-05dec13-en.pdf>

6.2. Informative References

7. Acknowledgments

   This document was prepared using 2-Word-v2.0.template.dot.









Chapin                   Expires July 7, 2014                 [Page 25]

Internet-Draft  draft-chapin-additional-reserved-tlds      January 2014


Authors' Addresses

   Lyman Chapin
   Interisle Consulting Group
   125A Magazine Street
   Cambridge, MA 02139
   USA

   Phone: +1 617 686 2527
   Email: lyman@interisle.net


   Mark McFadden
   InterConnect Communications Ltd
   Merlin House
   Station Road
   Chepstow  NP16 5PB
   UK

   Phone: +1 608 628 2674
   Email: markmcfadden@icc-uk.com




























Chapin                   Expires July 7, 2014                 [Page 26]

